app/views/comments/_comment.html.erb

<% book.comments.each do |com| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]