app/views/users/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 2]]
---
            </td>
            <td>コメント件数：<%= book.comments.count %></td>