app/views/books/show.html.erb

SELECT COUNT(*) FROM "comments" WHERE "comments"."book_id" = ?  [["book_id", 1]]
---
            </td>
            <td>コメント件数：<%= @book.comments.count %></td>