app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at", "rate", "category") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", "こう"], ["body", "du"], ["user_id", 1], ["created_at", "2021-12-02 07:16:21.102506"], ["updated_at", "2021-12-02 07:16:21.102506"], ["rate", 2.0], ["category", "rails"]]

  def index
    #過去一週間以内にふぁぼられた順
    @to = Time.current.at_end_of_day
    @from = (@to - 6.day).at_beginning_of_day
    books = Book.includes(:favorites).sort {|a,b|
---
SELECT "books".* FROM "books" ORDER BY created_at desc

  def update
    @book = Book.find(params[:id])
    # binding.pry
    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "impressions_count" = COALESCE("impressions_count", 0) + 1 WHERE "books"."id" = ?  [["id", 1]]

  def destroy
    book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]