app/controllers/comments_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "user_id", "book_id", "created_at", "updated_at", "score") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "いい感じ"], ["user_id", 1], ["book_id", 1], ["created_at", "2021-12-02 08:12:13.962927"], ["updated_at", "2021-12-02 08:12:13.962927"], ["score", 0.9]]
---
  def create
    @book = Book.find(params[:book_id])
    @comment = current_user.comments.new(comment_params)
    @comment.book_id = @book.id
    #natural language scores
    @comment.score = Language.get_data(comment_params[:comment])  #この行を追加
    if @comment.save